{
  "en": {
    "Language_DropDown": "English",
    "Top_Btn": "Top",
    "contact.title": "Contact Information",
    "contact.name": "CHEN,YI-YU",
    "Home.title": "CHEN,YI-YU Personal Game Studio. / Full-Stack Engineer",
    "profile.title": "Resume",
    "profile.intro": "CHEN,YI-YU Personal Resume.",
    "profile.basic.intro1": "Graduated from NCKU, Aeronautics and Astronautics.<br>Mainly studied Auto Control courses.",
    "profile.basic.intro2": "Enjoy playing games and have experience in publishing games.",
    "profile.basic.intro3": "National Cheng Kung University,<br>Aeronautics and Astronautics.",
    "profile.Skill.topic": "Skill",
    "profile.Skill.V1.Title01": "Programming",
    "profile.Skill.V2.Title01": "Tools",
    "profile.Skill.V3.Title01": "Game",
    "profile.Skill.V1.Title02": "Language",
    "profile.Skill.V2.Title02": "Version Control",
    "profile.Skill.V3.Title02": "Other",
    "profile.Education.topic": "Education",
    "profile.Education.title01": "National Cheng Kung University<br>Department of Aeronautics and Astronautics.",
    "profile.Education.des02": "Graduated in June 2020 with a major in control-related courses.<br>Including courses such as Feedback System Computer Control, Control System Theory, Introduction to Engines, and Aircraft Design.<br>The senior project focused on indoor automated control navigation.<br><br><span class=\"Text-point2\">Have a strong interest in gaming, and have pursued related courses on my own while in school.</span>",
    "profile.Experience.topic": "Experience",
    "profile.Experience.title00": "Mitfun Co., Ltd.",
    "profile.Experience.des00": "<span class=\"Text-point2\">Front-end Engineer.</span> Use <span class=\"Text-point\">Unity</span> as a development tool, with <span class=\"Text-point\">C# as the main programming language, and Objective-C, JavaScript as supporting languages.</span> <br><br>During my tenure, I focused on the <span class=\"Text-point\">\"Chibi Maruko-chan\" project primarily at Gamania Co., Ltd.</span>, where I was responsible for the <span class=\"Text-point\">game's core development, integration of various commonly used third-party plugins (FB, AppsFlyer, Firebase, GoogleMobileAds, etc.), assisting with C2S API development, and maintaining the iOS iPA.</span> <br><br><span class=\"Text-point2\">Released on both platforms,GooglePlay and AppStore.</span>",
    "profile.Experience.title01": "NCKU Game-designing Workshop",
    "profile.Experience.des01": "<span class=\"Text-point2\">Student.</span> Duties including <span class=\"Text-point\">game designing, team communicating, profit analysis, game system, game world settings, narratology, elements of popular game analysis, and some experience sharing.</span> In the end of the workshop, planning and implement with a team ,and then <span class=\"Text-point\">go public and management.</span>",
    "profile.Experience.title02": "Advanced Design Workshop",
    "profile.Experience.des02": "<span class=\"Text-point2\">Student.</span> Lecture by <span class=\"Text-u\">LIYU,LIN</span>, a <span class=\"Text-point\">designer of LEGO Group</span>, Denmark, analyzing actual problem in design and User experience for products in different ages, so as to adjusting the products. In the end of the workshop, selecting a user and analyzing them, to design a product for LEGO.",
    "profile.Experience.title03": "Universal Scientific Industrial(China,Kunshan)",
    "profile.Experience.des03": "<span class=\"Text-point2\">Test engineer intern.</span> Duties including <span class=\"Text-point\">erecting test-station, quality control, process of product developing, failure analysis, error verify, GR&R , new product introduction.</span> Promote the ability of analyzing and solving problems.",
    "profile.Experience.title04": "NCKU Aeronautics and Astronautics Camp",
    "profile.Experience.des04": "<span class=\"Text-point2\">Event General Coordinator.</span> <span class=\"Text-point\">Preparing half a year.</span> Staff members about 70, and <span class=\"Text-point\">200 people participate</span> the event. Main duties including <span class=\"Text-point\">time schedule, event planning, team management, work assignments, publicists.</span> Promote the ability of team management.",
    "profile.Experience.title05": "NCKU Stray Animal Volunteer",
    "profile.Experience.des05": "<span class=\"Text-point2\">Volunteer.</span> Develope friendly and selfless character. Already participated in it about 4 years.",
    "profile.Experience.title06": "DIGICENTRE Co., Ltd.",
    "profile.Experience.des06": "<span class=\"Text-point2\">Full Stack Engineer</span>, main responsibilities include the following:<br> 1. Responsible for testing & expanding <span class=\"Text-point\">SPKITA GameCloud</span> (SGC)<br> 2. Integrating & fine-tuning related <span class=\"Text-point\">AI services</span> (Azure Open AI & Amazon Bedrock)<br> 3. Assisting with \"social engineering\" <span class=\"Text-point\">front-end and back-end development</span> (React framework)<br><br>Assisted SGC in developing the <span class=\"Text-point\">multiplayer online game AnimalStrikers with Unity</span><br>and used AI to help massively create templates for a social platform, while also assisting in front-end and back-end development.<br><br><span class=\"Text-point2\">SGC</span> is a <span class=\"Text-point\">cloud platform for developing online games</span>, designed to replace game servers, self-hosted machines, and data centers. As a SaaS platform, it offers multiple online real-time interactive features such as items, leaderboards, guilds, and mailboxes. Its goal is to provide convenient development options for the game development community, lowering the threshold and cost of developing online games, and supporting the most widely-used game engines, Unity & Unreal.<br>",
    "profile.Autobiography.topic": "Autobiography",
    "profile.Autobiography.des": "Graduated from <span class=\"Text-point\">National Cheng Kung University,<br>Aeronautics and Astronautics.</span><br><span class=\"Text-point\">With a great capacity for learning</span>, I am able to get continuous growth by experience while working on projects, even in unfamiliar territory.<br><br><br><span class=\"Text-bu\">【Unity and Unreal Engine expertise】</span><br><br><br>I took courses at department of Computer Science & Information Engineering, and <span class=\"Text-point\">be familiar with programming languages.</span> Most proficient in<span class=\"Text-point\"> C#, and with knowledge of C, C++, Python, Objective-C, and JavaScript.</span> Has <span class=\"Text-point\">experience in C2S API , integrating various third-party plugins and platforms (FB, AppsFlyer, Firebase, Google Mobile Ads), and releasing game on AppStore, GooglePlay.</span><br><br><span class=\"Text-point\">Familiar with HTML and has built personal websites.</span> Has experience in version control working with teams or individual, such as <span class=\"Text-point\">SVN and Git.</span> Currently, I has <span class=\"Text-point\">developed a game independently released on GooglePlay.</span><br><br>Due to past participation in game planning, I able to communicate and collaborate efficiently with artists and planners in the team. Also, I am <span class=\"Text-point\">goot at problem analysis and debugging.</span> After identifying a bug, I able to progressively trace bug to identify its cause based on the conditions and environment, so as to make necessary corrections.<br><br><br><br><span class=\"Text-bu\">【Work Experience, Front-end Engineer】</span><br><br><br>After graduation, my first job was as a <span class=\"Text-point\">front-end engineer at Mitfun Co., Ltd.</span><br><br>During this period, I primarily focused on \"Chibi Maruko-chan - Cheerful Spirit\". The game was <span class=\"Text-point\">developed using Unity.</span> With C# as the main language, also use Objective-C and JavaScript as support. I am responsible for <span class=\"Text-point\">overall game core development, integration of various commonly third-party plugins, assisting with C2S API and iOS packaging and deployment.</span><br><br>Apart from significant improvement in Unity development skills, I also gained further experience in Objective-C and JavaScript due to the need for communication with native features on Android and iOS platforms.<br><br><br><br><span class=\"Text-bu\">【Other Experience】</span><br><br><br>I am <span class=\"Text-point\">passionate about games</span> and frequently watches videos of various game genres. My Favorite game is \"Crown Trick\", which has a simple game system but a unique style, addictive artwork, and excellent attention to gamedesign. Besides, my favorite game genre is TCG. \"My Turn ! \" is a outstanding one of them particularly that offers exceptional balance and delightful artwork and without unnecessary comple system.<br><br>I Participated in the <span class=\"Text-point\">Game Design Workshop</span> at National Cheng Kung University, which covered game planning, core systems, game universe , and team organization. I also has practical experience in writing game proposals, which enhanced understanding of the requirements about planning and artistic aspects. Therefore, I can communication with the team more smootherly.<br><br>Has involved in <span class=\"Text-point\">user analysis during design workshops,</span> I am capable of analyzing the needs of different user groups, understanding their preferences towards games, identifying their requirements, and improving user experience. Applying these skills in work reduces communication costs with team and provides great idea to adjust game development.<br><br>I <span class=\"Text-point\">actively participated in various activities and volunteering during university,</span> serving as the Head Organizer of the Aerospace Camp, leading a team of approximately 200+ members. To plan, supervise, and execute the entire event, I gained experience in arranging workflows, time management, task assignments, and developed effective communication skills with the team. These experiences enable me to integrate into a team more quickly in professional setting.<br><br>I has experience <span class=\"Text-point\">using Linux and ROS for a 2D indoor navigation project,</span> which involved hardware (IMU,control board, electronic speed controller, Lidar), mapping, and navigation. The objective was toconstruct an indoor map using Lidar and give commands to the robot to autonomously navigate to specificlocations on the map. I am responsible for navigation, controlled the motors using an electronic speedcontroller and sensors, enabling the autonomous navigation of the robot to reach its destination without human intervention.",
    "portfolio.title": "Portfolio",
    "portfolio.intro": "CHEN,YI-YU Personal Portfolio.",
    "portfolio.AIDrawing.title": "AI Drawing (Front-end)",
    "portfolio.AIDrawing.des": "This project fine-tunes <span class=\"Text-point\">Stable Diffusion</span> based on user-provided images and prompts, converting it into a corresponding <span class=\"Text-point\">fine-tuned model</span> that can <span class=\"Text-point\">generate images in a specified style</span> or even <span class=\"Text-point\">mimic the style of a specified creator</span>.<br><br>My responsibilities included the front-end display, developed with <span class=\"Text-point\">React</span> as the front-end framework, using <span class=\"Text-point\">Zustand</span> for state management, and <span class=\"Text-point\">Tailwind</span> for CSS.",
    "portfolio.AITranslate.title": "AI Translate (Front-end & back-end)",
    "portfolio.AITranslate.des": "Supports <span class=\"Text-point\">six languages</span> (German, French, Chinese, Spanish, Japanese, English). This project receives translation documents provided by users in JSON format, sends them to the backend, where the backend connects to <span class=\"Text-point\">AWS Bedrock service</span>. With finely tuned training prompts, it accurately converts the content to the specified language and format, then returns it to the front end for download.<br><br>A solo project, with the front end developed using the <span class=\"Text-point\">React framework</span>. The backend is hosted on a <span class=\"Text-point\">VM</span> and handles communication with AWS Bedrock. ( Initially used Microsoft Azure Open AI, later switched to AWS Bedrock due to cost and effectiveness considerations. )",
    "portfolio.AnimalStrikers.gamename": "AnimalStrikers",
    "portfolio.AnimalStrikers.title": "For the berries! Let’s fight until the last minute!",
    "portfolio.AnimalStrikers.des": "Choose your character and ultimate skill, use a variety of weapons and items, crush your opponents, and survive until the end!<br>Fight and fight! All for the berries!",
    "portfolio.AnimalStrikers.intro": "A multiplayer party game developed using <span class=\"Text-point\">SPKITA GameCloud (SGC)</span> as the underlying communication platform. Built with Unity as the development engine, the game’s core features include <span class=\"Text-point\">online connectivity, skills, weapons, a shop, leaderboards, and other game elements.</span> The main objective is to knock down opponents and achieve the highest kill score. <br><br>AnimalStrikers is hosted on a self-deployed <span class=\"Text-point\">VM as the Server</span> and references the CSGO connection framework. It adopts a <span class=\"Text-point\">server-authoritative control</span> model and utilizes a <span class=\"Text-point\">hybrid solution of state synchronization and frame synchronization</span> for connectivity. A buffer collects commands and sends them periodically to the server (S), after which the system synchronizes all player information at regular intervals to the client (C) for correction. If the data differs from <span class=\"Text-point\">local prediction</span>, corrections are applied. <br><br><strong>The game supports both PC and mobile platforms, but there are currently no plans for release.</strong>",
    "portfolio.beten.gamename": "BeTen",
    "portfolio.beten.title": "Chip Elimination! A Fun and Relaxing Adventure.",
    "portfolio.beten.des": "There is only one goal in this game, Turn all the blocks into 10!By combining blocks to add up to 10,You can successfully eliminate them. As the speed increases and various strange blocks are added, How far can you go in this adventure?",
    "portfolio.beten.intro": "During my free time after work, I developed the game \"BeTen\" with a learning mindset. <span class=\"Text-point\">The game was inspired by \"Twenty\"</span> and developed solely by me, including <span class=\"Text-point\">the art, design, and programming aspects.</span> \"BeTen\" has a solid foundation,<span class=\"Text-point\"> with well-designed Singleton and Manager systems,</span> including various features such as <span class=\"Text-point\">multilingual support, difficulty control, beginner tutorials, local saving, music and sound effects, and advertisement monetization.</span> <br><br><strong>The game has been released on Google Play and promoted through social media and paid advertising.</strong>",
    "portfolio.Maruko.gamename": "CHIBI MARUKO CHAN-Cheerful Spirit",
    "portfolio.Maruko.title": "A puzzle game suitable for all ages, enjoy the most exciting match-three levels!",
    "portfolio.Maruko.des": "The childhood classic cartoon \"Chibi Maruko-chan\" is back! Join Chibi Maruko-chan to relive the classic cartoon moments, and collect lots of cute characters and various fashion styles! <br>Are you ready to replenish your daily energy with Chibi Maruko-chan?",
    "portfolio.Maruko.intro": "When I work at <span class=\"Text-point\">Mitfun</span>, I participated in an outsourced development project from <span class=\"Text-point\">Gamania Co., Ltd.</span> The project was <span class=\"Text-point\">developed using \"Unity\" as game engine and BrainCloud as GameServer.<br><br>This game <span class=\"Text-point\">features match-3 as the core gameplay</span>, with various obstacles and power-ups. It also includes social features such as family and guild, as well as collecting the classic cartoon characters and stage scenes.</span><br><br>My responsibilities included the<span class=\"Text-point\"> development of the game's overall core and foundation, iOS iPA, and part of the UI design. I also handled the integration of various third-party plugins and platforms, such as Facebook, AppsFlyer, Firebase, GoogleMobileAds, and Beanfun. Throughout the project, I also assisted with some of the C2S API development.</span><br><br><strong>The game released on both Google Play and the App Store, with a dedicated international version.</strong>",
    "portfolio.brickbreakers.gamename": "BrickBreakers",
    "portfolio.brickbreakers.title": "Simple Brick Breaker game.",
    "portfolio.brickbreakers.des": "A traditional brick-breaking game?<br>Face the relentless emergence of monsters.<br>Will you be able to successfully complete the challenge?",
    "portfolio.brickbreakers.intro": "To <span class=\"Text-point\">learn and familiarize myself with the UE5 engine</span>, I started developing this game. Following the official tutorials of Unreal 5, I progressed step by step to completion. This included <span class=\"Text-point\">creating various meshes, textures, and audio resources, as well as learning the blueprint system</span>.<br>The game features a <span class=\"Text-point\">well-rounded gameplay loop</span> and <span class=\"Text-point\">impressive artistic presentation</span>.<br><br><strong>This game was created solely for the purpose of learning.</strong>",
    "portfolio.StackOBot.gamename": "StackOBot",
    "portfolio.StackOBot.title": "3D Puzzle Mystery Game.",
    "portfolio.StackOBot.des": "You are a little robot, embarking on a journey to uncover the truth about yourself.<br>Embark on an adventure with your fellow robot! ",
    "portfolio.StackOBot.intro": "To <span class=\"Text-point\">learn and familiarize myself with the UE5 engine</span>, I started developing this game. Utilizing pre-existing meshes, textures, and other artistic materials, I enhanced them through post-processing techniques. The game encompasses learning and utilizing various systems such as <span class=Text-point>character animation, game systems, particles, and blueprints</span>. <br><span class=\"Text-point\">It serves as a game prototype framework with complete gameplay logic</span>.<br><br><strong>This game was created solely for the purpose of learning.</strong>",
    "portfolio.Adventure.gamename": "Adventure",
    "portfolio.Adventure.title": "Random Dungeon 2D Roguelike Game.",
    "portfolio.Adventure.des": "A mundane cave suddenly cracks with darkness! Countless monsters try to gain their freedom from within. A young adventurer decides to step up, gathering like-minded partners, to push back the invasion of monsters!<br><br>Facing an endless stream of monsters and an expanding crack of darkness, survival becomes the most luxurious wish.",
    "portfolio.Adventure.intro": "When I was at university, I created the game for the purpose of learning game development. As a fan of <span class=\"Text-point\">RogueLike games</span>, I attempted to create my own version. The game core involves <span class=\"Text-point\">randomly generated dungeons</span> with <span class=\"Text-point\">several types of monsters and a final boss</span>. The game includes systems such as <span class=\"Text-point\">sound effects, damage displays, and animations</span> to enhance the player's experience. Additionally, there are <span class=\"Text-point\">dialogue, inventory, equipment, and skill systems</span> to further improve the gameplay experience. <br><br><strong>The game made with a focus on learning, without plans for release.</strong>",
    "portfolio.Althea.gamename": "Althea",
    "portfolio.Althea.title": "2D medieval puzzle game",
    "portfolio.Althea.des": "The Black Death is rampant in Europe! Plague doctors and the Church are working hard to control the outbreak of it, but the protagonist's father, who is also a plague doctor, has disappeared without a trace. As the epidemic continues to escalate, the powerful and influential people seem to be immune.<br><br>In order to find his father, the protagonist embarks on a journey to reveal the truth.",
    "portfolio.Althea.intro": "A student team worked together to develop this game, which has a playtime of approximately 15-20 minutes. It tells an alternate story set during the time of the Black Plague in Europe, where the Church seeks to expand its power. The game includes various systems such as <span class=\"Text-point\">dialogue, save/load, and inventory.</span> There are four possible endings, and <span class=\"Text-point\">I was responsible for the overall system and story structure as the planner.</span><br><br><strong>This game was developed with the goal of learning and is available on the itch.io platform.</strong>",
    "portfolio.Minecraft.gamename": "Mini Minecraft",
    "portfolio.Minecraft.title": "Minecraft的模仿練習作品",
    "portfolio.Minecraft.des": "Welcome to the world of Mini Minecraft! Create your own world to your heart's content! There are unique landscapes during both day and night, but be careful of monster attacks!<br><br>This is my world, and I'm here to create!",
    "portfolio.Minecraft.intro": "Project made for learning purpose, created by <span class=\"Text-point\">Unity</span> engine, and with <span class=\"Text-point\">Minecraft </span>as the imitated target, developed a simplified version ofthe Minecraft game framework. Other game systems include <span class=\"Text-point\">random generation,monster system, day and night system, inventory system, as well as other basic game systems and standard game interfaces.</span><br><br><strong>The game made with a focus on learning, without plans for release.</strong>",
    "portfolio.Kindness.gamename": "Kindness",
    "portfolio.Kindness.title": "2D Single-player Turn-based Card game.",
    "portfolio.Kindness.des": "Right or wrong, always keep in mind! Everyone has their own stance, but kindness does not. Regardless of stance, we are here to save every person fighting for kindness.<br><br>Is this still the familiar home to me?",
    "portfolio.Kindness.intro": "Project made for learning purpos, created using <span class=\"Text-point\">Unity</span> engine. The theme of this card game was based on the hottest topic, the anti-extradition law protests,  at the time. Players act as first responders trying to save lifes during the chaos, with a single turn lasting 30 seconds during which the protesters face constant attacks. There are no sides in this game, only a common goal to save as many lifes as possible.</span><br><br><strong>The game made with a focus on learning, without plans for release.</strong>",
    "other.title": "Other",
    "other.maruko.title": "CHIBI MARUKO CHAN-Cheerful Spirit",
    "other.AnimalStrikers.title": "AnimalStrikers",
    "common.go": "Go !"
  },
  "zh": {
    "Language_DropDown": "中文",
    "Top_Btn": "回頂部",
    "contact.title": "聯絡資訊",
    "contact.name": "陳奕宇",
    "Home.title": "陳奕宇個人遊戲工作室 / 全端工程師",
    "profile.title": "個人履歷",
    "profile.intro": "陳奕宇個人履歷",
    "profile.basic.intro1": "畢業於成大航太，在學期間主要修習控制課程。",
    "profile.basic.intro2": "喜愛遊戲，有 GooglePlay & Appstore 上架經驗。",
    "profile.basic.intro3": "國立成功大學，航空太空工程(DAA)",
    "profile.Skill.topic": "技能",
    "profile.Skill.V1.Title01": "程式語言",
    "profile.Skill.V2.Title01": "工具",
    "profile.Skill.V3.Title01": "遊戲相關",
    "profile.Skill.V1.Title02": "語言",
    "profile.Skill.V2.Title02": "版本控制",
    "profile.Skill.V3.Title02": "其他",
    "profile.Education.topic": "學歷",
    "profile.Education.title01": "成功大學航空太空工程學系",
    "profile.Education.des02": "2020年6月畢業，主修控制相關課程。<br>包含回授系統電腦控制、控制系統理論、發動機概論、飛機設計等課程。<br>畢業專題為室內自動控制導航。<br><br><span class=\"Text-point2\">喜愛遊戲，在校自行修習相關課程並學習。</span>",
    "profile.Experience.topic": "經歷",
    "profile.Experience.title00": "Mitfun 聚樂方塊股份有限公司",
    "profile.Experience.des00": "<span class=\"Text-point2\">前端工程師</span>，主要使用<span class=\"Text-point\">Unity</span>做為開發工具，以<span class=\"Text-point\">C#為主要語言，並使用Objective-C和JavaScript作為輔助</span>。<br><br>在職期間主要專注在<span class=\"Text-point\">遊戲橘子的專案「櫻桃小丸子」</span>上，負責<span class=\"Text-point\">遊戲核心、串接各種常用的第三方插件(FB、AppsFlyer、Firebase、GoogleMobileAds等)、協助C2S的API，及iOS的iPA維護</span>。<br><br><span class=\"Text-point2\">遊戲已在雙平台上架。</span>",
    "profile.Experience.title01": "成功大學遊戲設計工作坊",
    "profile.Experience.des01": "<span class=\"Text-point2\">學員</span>，主要內容包含<span class=\"Text-point\">遊戲企劃撰寫、團隊架構解析、遊戲營利分析、系統架構、世界觀、敘事學、當紅遊戲分析、以及一些經驗分享</span>，並以<span class=\"Text-point\">團隊撰寫企畫，最後進行上市及管理。</span>",
    "profile.Experience.title02": "高階設計工作坊",
    "profile.Experience.des02": "<span class=\"Text-point2\">學員</span>，由<span class=\"Text-point\">瑞典#樂高團隊設計師<span class=\"Text-u\">林立瑜</span>學姊</span>講授，分析設計實際問題及使用者體驗，分析不同年齡層對於產品不同的需求面向，並加以調整， 最後自行選定使用者並分析其需求，規劃設計出一個樂高產品。",
    "profile.Experience.title03": "環鴻電子(中國昆山)",
    "profile.Experience.des03": "<span class=\"Text-point2\">實習測試工程師</span>，工作包含自行<span class=\"Text-point\">架設測試站、品質控制、產品研發流程、失效分析、錯誤驗證、GR&R、 NPI</span>等各種日常學習，增進自身能力、視野、以及系統式的學習培養，有效分析及處理問題。",
    "profile.Experience.title04": "成功大學航太學術研討營",
    "profile.Experience.des04": "<span class=\"Text-point2\">總召集人</span>，<span class=\"Text-point\">籌備期半年</span>，工作人員70+，<span class=\"Text-point\">總規模約200的大型營隊</span>，主要項目包含<span class=\"Text-point\">時間排程、活動規劃、團隊管理、工作分配、 對外發言及公關</span>，能有效管理團隊。",
    "profile.Experience.title05": "成功大學流浪動物志工",
    "profile.Experience.des05": "<span class=\"Text-point2\">志工</span>，<span class=\"Text-point\">服務性志工</span>，培養付出及友愛的品德，目前已參與約4年。",
    "profile.Experience.title06": "果核數位股份有限公司",
    "profile.Experience.des06": "<span class=\"Text-point2\">全端工程師</span>，主要職責包含以下內容：<br>1. 負責測試&擴展 <span class=\"Text-point\">SPKITA GameCloud</span> (SGC)<br>2. 串接&微調相關 <span class=\"Text-point\">AI服務</span> (Azure Open AI & Amazon Bedrock)<br>3. 協助\"社交工程\" <span class=\"Text-point\">前後端開發</span> (React框架)<br><br>協助 SGC 使用 <span class=\"Text-point\">Unity 開發Demo多人連線遊戲 AnimalStrikers</span><br>並使用AI協助大規模創建社交平台的範本，同時協助前後端進行開發。<br><br><span class=\"Text-point2\">SGC</span>，主打<span class=\"Text-point\">開發連線遊戲的遊戲雲平台</span>旨在取代遊戲伺服器、自建主機與機房的 SaaS 平台，並提供物品、積分板、公會、郵箱等多項線上即時互動功能。目標在為遊戲開發社群提供便利的開發選項，降低連線遊戲開發門檻與成本，支援市占率最高的遊戲引擎 Unity & Unreal。<br>",
    "profile.Autobiography.topic": "自傳",
    "profile.Autobiography.des": "畢業於<span class=\"Text-point\">成功大學航空太空學系。</span><br><span class=\"Text-point\">學習能力極強</span>，即使不熟悉或不擅長的領域，也能快速在專案中摸索，吸收經驗並成長。<br><br><br><span class=\"Text-bu\">【擅長使用Unity，正在學習UnrealEngine】</span><br><br><br>在資工系修過課程，<span class=\"Text-point\">熟悉程式語言</span>，最熟悉的為<spanclass=\"Text-point\">C#，C、C++、Python、Objective-C、JavaScript</span>也會使用。有<span class=\"Text-point\">雙平台上架、C2S的API、串接各種第三方插件和平台的串接(FB、AppsFlyer、Firebase、GoogleMobileAds</span>)的經驗。<br><br><span class=\"Text-point\">熟悉HTML，並有架設自己的個人網站</span>。有和團隊或自己的版控經驗，<span class=\"Text-point\">熟悉SVN和Git的操作。</span>也<span class=\"Text-point\">有自己獨立開發的遊戲，目前正在GooglePlay上架。</span><br><br>因為有參與遊戲企畫的經驗，能有效率地和團隊中的美術或企劃進行溝通及修正。同時也非常<span class=\"Text-point\">擅長分析問題和Debug</span>，在發現Bug之後，能從Bug產生的狀況及環境，逐步還原起因，並進行修正。<br><br><br><br><span class=\"Text-bu\">【工作經驗 - 前端工程師】</span><br><br><br>畢業後第一份工作，是在<span class=\"Text-point\">聚樂方塊數位股份有限公司做前端工程師。</span><br><br>工作期間，主要專注在「櫻桃小丸子 - 元氣版」，遊戲<span class=\"Text-point\">使用Unity做為開發工具</span>，以C#為主要語言，並使用Objective-C和JavaScript作為輔助。本人負責<span class=\"Text-point\">整體遊戲核心、串接各種常用的第三方插件、協助C2S的API、iOS打包上架處理。</span><br><br>在此工作，除Unity相關的開發技能有重大的進步之外，過程中也因需要和Android和iOS的原生功能去做溝通，進一步鍛鍊出Objective-C和JavaScript的能力。<br><br><br><br><span class=\"Text-bu\">【其他經歷】</span><br><br><br><span class=\"Text-point\">喜愛遊戲</span>，常觀看各種遊戲類型的影片，最喜愛的遊戲是「Crown Trick」（不思議的皇冠），簡單的遊戲系統卻有著獨特的風格，和令人沉迷的系統和彩蛋，遊戲細節也都刻畫著十分優秀。而個人最喜愛的遊戲類型是TCG，其中最喜愛一款「我的回合」的遊戲，平衡十分優秀，美術音效也都十分令人喜愛，而遊戲耗時不長，也無多餘繁瑣的系統。<br><br>在<span class=\"Text-point\">成功大學遊戲設計工作坊學習過</span>，包含遊戲企劃、營利、核心系統、世界觀、團隊架構等內容，也實際撰寫過企劃書，這些經驗讓我更懂企畫及美術的需求，能更順暢地的和團隊溝通。<br><br>也參與過<span class=\"Text-point\">設計工作坊的使用者分析</span>，能夠分析不同客群對於遊戲的需要，掌握對遊戲的喜好，找出對遊戲的需求並鎖定使用者，改善使用者體驗，其運用在工作中，能減少與美術或是遊戲企劃上的溝通成本，並在遊戲開發中提供意見。<br><br><span class=\"Text-point\">在校期間積極參與各項活動及志工</span>，也曾身為 航太營 總召集人，帶領約200+的活動團隊，規劃、監督並實行整個活動，在過程中有安排流程、時間管理、任務安排的經驗，也能有效與團隊內任何職務的人溝通，在這些累積的經驗，能使我在職場上更快融入團隊中。<br><br><span class=\"Text-point\">有使用Linux及Ros，進行2D室內導航的專題的經驗</span>，從硬體(IMU、控制板、電子變速器、Lidar)到建圖及導航。任務目標為能透過光達(Lidar)建構室內地圖後，能對機器人下指令，使其自動到達地圖上指定位置。本身負責導航的部分，是利用電子變速器控制馬達，並輔以傳感器，使自走車能在無人控制下，進行自主導航，並抵達目的地。<br><br>",
    "portfolio.title": "作品集",
    "portfolio.intro": "陳奕宇個人作品集",
    "portfolio.AIDrawing.title": "AI繪圖 (前端)",
    "portfolio.AIDrawing.des": "此專案會根據使用者傳入的照片 & 提示詞，將<span class=\"Text-point\">Stable Diffusion</span>進行微調，轉成相對應的<span class=\"Text-point\">微調模型</span>，使其能夠<span class=\"Text-point\">產生指定風格</span>，甚至是<span class=\"Text-point\">模仿指定創作者的風格</span>，進行圖片生成。<br><br>本人負責的部分是網頁前端的顯示，使用<span class=\"Text-point\">React</span>，作為前端的開發框架，運用<span class=\"Text-point\">Zustand</span>進行狀態管理，css則是使用<span class=\"Text-point\">Tailwind</span>。",
    "portfolio.AITranslate.title": "AI翻譯 (前端 & 後端)",
    "portfolio.AITranslate.des": "支援<span class=\"Text-point\">六種語言</span>(德文、法文、中文、西班牙文、日文、英文)。此專案會接收使用者傳入的翻譯文件(Json格式)，傳遞至後端，由後端聯繫<span class=\"Text-point\">AWS的Bedrock服務</span>，並透過調教好的訓練詞，準確轉為指定語言及格式，並回傳至前端供下載。<br><br>單人負責的專案，前端使用<span class=\"Text-point\">React框架</span>。後端架設在<span class=\"Text-point\">VM</span>上，且負責和AWS Bedrock進行溝通。(初期使用Microsoft Azue Open AI，後因成本和效果考量，轉換至AWS Bedrock)",
    "portfolio.AnimalStrikers.gamename": "漿果戰祭",
    "portfolio.AnimalStrikers.title": "為了漿果！來場熱血沸騰的戰鬥吧！",
    "portfolio.AnimalStrikers.des": "選擇你的角色和必殺技，利用各式的武器和道具，擊垮你的對手並想辦法生存到最後！<br>戰吧！一切都是為了漿果。",
    "portfolio.AnimalStrikers.intro": "使用果核數位自建的<span class=\"Text-point\">遊戲雲平台(SGC)</span>，作為底層連線通訊，開發而成的多人派對遊戲。使用Unity為開發引擎，遊戲核心包含<span class=\"Text-point\">連線、技能、武器、商城、排行榜等遊戲要素。</span>遊戲目標是擊倒對手，想辦法獲得最多的擊殺分數。<br><br>漿果戰祭是自行架設<span class=\"Text-point\">VM做為Server</span>，並參考CSGO的連線架構，採用<span class=\"Text-point\">伺服器權威控制</span>並<span class=\"Text-point\">使用狀態同步&幀同步的混合模式</span>做為連線架構。設有緩衝區(Buffer)收集指令後定時傳送至S端，而後系統會有固定的頻率，同步所有玩家資訊給C端作為修正用，若和本地<span class=\"Text-point\">預測不一樣</span>則會進行修正。<br><br><strong>遊戲支援PC及手機雙平台，尚未有上架打算。</strong>",
    "portfolio.beten.gamename": "BeTen",
    "portfolio.beten.title": "一個大人小孩都能上手，一場接著一場的方塊消除冒險！",
    "portfolio.beten.des": "遊戲目標只有一個，讓所有方塊都變成10！方塊只要加起來為10，便能成功消除方塊。隨著速度的增加，和各種奇怪的方塊加入，這場冒險究竟還能走到多遠？",
    "portfolio.beten.intro": "在工作期間，抱著學習的心態，在下班閒暇之餘開始製作此遊戲。此遊戲是<span class=\"Text-point\">受「Twenty」這款遊戲作為啟發</span>，而成為現在的「BeTen」。而我做為唯一開發者，從<span class=\"Text-point\">美術、企劃、程式均一手包辦</span>。「BeTen」擁有完善的基礎架構，<span class=\"Text-point\">從Singleton到各種Manager</span>都十分完善，其中包含<span class=\"Text-point\">多語、難度控制、新手教學、本地存檔、音樂音效、廣告變現等各式系統。</span><br><br><strong>本遊戲在GooglePlay上市，並有在社群網站宣傳及購買廣告宣傳。</strong>",
    "portfolio.Maruko.gamename": "櫻桃小丸子-元氣版",
    "portfolio.Maruko.title": "適合全年齡的益智遊戲，享受最暢快的三消關卡!",
    "portfolio.Maruko.des": "童年經典卡通櫻桃小丸子回來了!快來跟著小丸子一起回味經典卡通片段，還有超多可愛角色及琳琅滿目的服裝造型等著你來蒐集!<br><br>準備好跟著小丸子補充你的日常元氣了嗎?",
    "portfolio.Maruko.intro": "在<span class=\"Text-point\">Mitfun聚樂方塊</span>時，由<span class=\"Text-point\">遊戲橘子</span>發外包的研發案。<span class=\"Text-point\">運用Unity遊戲引擎開發，BrainCloud作為GameServer</span>。<br><br>此遊戲以<span class=\"Text-point\">三消為遊戲核心</span>，有著各種不同的障礙物及道具，融合家族、公會等社交玩法，收集多種經典卡通角色和舞台場景。<br><br>本人負責的部分包含:<span class=\"Text-point\">整體遊戲核心及底層、iOS的iPA、部分的UI製作各種第三方插件和平台的串接(FB、AppsFlyer、Firebase、GoogleMobileAds、Beanfun等)。過程中也會協助部分C2S的API</span>。<br><br><strong>本遊戲在GooglePlay和AppStore上架，並有專門的國際版本。</strong>",
    "portfolio.brickbreakers.gamename": "BrickBreakers",
    "portfolio.brickbreakers.title": "最簡單的打磚塊遊戲！",
    "portfolio.brickbreakers.des": "一款最傳統的打磚塊遊戲？<br>面對怪物不斷湧現，<br>你! 是否能順利完成挑戰?",
    "portfolio.brickbreakers.intro": "為<span class=\"Text-point\">學習和熟悉UE5引擎，因而開始製作此遊戲</span>。根據Unreal 5的官方教程，一步一腳印製作完成。包含從<span class=\"Text-point\">製作各種Mesh到Texture和Audio資源、到藍圖系統的學習</span>。<br>擁有<span class=\"Text-point\">完善的遊戲循環</span>和<span class=\"Text-point\">完整的美術表現。</span><br><br><strong>僅為學習為目標製作的遊戲。</strong>",
    "portfolio.StackOBot.gamename": "StackOBot",
    "portfolio.StackOBot.title": "3D 益智解謎遊戲",
    "portfolio.StackOBot.des": "你是小小機器人，為了尋找關於自身的真相，踏上旅程。<br>和你的小機器人同伴一起探險吧!",
    "portfolio.StackOBot.intro": "為<span class=\"Text-point\">學習和熟悉UE5引擎，因而開始製作此遊戲</span>。使用現成的Mesh和Texture等美術材料，後製過後運用。遊戲包含從<span class=\"Text-point\">人物動畫、遊戲系統、粒子、藍圖等系統的學習使用</span>。<br><span class=\"Text-point\">一個遊戲雛型框架，有完整的遊戲邏輯</span>。<br><br><strong>僅為學習為目標製作的遊戲。</strong>",
    "portfolio.Adventure.gamename": "Adventure",
    "portfolio.Adventure.title": "隨機地城 2D RougeLike 類遊戲",
    "portfolio.Adventure.des": "平凡的山洞突然出現黑暗的裂縫！無數的魔物嘗試從中獲取自由。一位年輕的冒險家決定挺身而出，集結志同道合的夥伴，共同擊退魔物的入侵。<br><br>面對源源不絕的魔物，和逐漸擴張的黑暗裂縫，生存是最奢侈的願望。",
    "portfolio.Adventure.intro": "在學期間，以學習為目標製作的遊戲，因<span class=\"Text-point\">熱愛RougeLike遊戲</span>，故嘗試自己寫了一款。遊戲核心為<span class=\"Text-point\">隨機生成地牢</span>，並有<span class=\"Text-point\">數種小怪和最終頭目</span>。配合<span class=\"Text-point\">音效、傷害顯示、動畫等系統增加打擊感</span>，並有<span class=\"Text-point\">對話、背包、裝備等系統，更有技能系統</span>來增加玩家遊戲體驗。<br><br><strong>學習為目標製作的遊戲，無上架計畫。</strong>",
    "portfolio.Althea.gamename": "Althea",
    "portfolio.Althea.title": "2D 中世紀解謎遊戲",
    "portfolio.Althea.des": "歐洲黑死病橫行！瘟疫醫生和教會努力控制疫情，而身為瘟疫醫生的父親一去不復返，疫情逐漸加溫，有權有勢的人身體卻毫無異樣。<br><br>為尋找父親踏上旅途，隱藏在背後的真相究竟是？",
    "portfolio.Althea.intro": "學生團隊一起開發，遊戲時長約為 15~20分鐘，講述歐洲黑死病時期，教會想要擴權的架空故事，包含<span class=\"Text-point\">對話、存讀檔、背包</span>等各種系統。<br>有四種解局，<span class=\"Text-point\">本人負責整體系統和故事架構的企劃</span>。<br><br><strong>學習為目標製作的遊戲，在itch.io 平台上架。</strong>",
    "portfolio.Minecraft.gamename": "Mini Minecraft",
    "portfolio.Minecraft.title": "Minecraft的模仿練習作品",
    "portfolio.Minecraft.des": "這裡是小小Mini Minecraft的世界！盡情創造屬於自己的世界吧！白天和黑夜都有屬於自己的風景，不過還請小心怪物們的襲擊!<br><br>我的世界，我來創造！",
    "portfolio.Minecraft.intro": "學習過程中的專題，<span class=\"Text-point\">使用Unity製作</span>，並以Minecraft為模仿目標，寫出<span class=\"Text-point\">簡易版本的Minecraft遊戲框架</span>，其他遊戲系統包含<span class=\"Text-point\">隨機生成、怪物系統、日夜系統、背包系統，以及其他基本遊戲系統和標準遊戲介面</span>。<br><br><strong>學習為目標製作的遊戲，無上架計畫。</strong>",
    "portfolio.Kindness.gamename": "善良",
    "portfolio.Kindness.title": "2D 單人回合卡牌遊戲",
    "portfolio.Kindness.des": "是否對錯，存在人們心中，無所不在!每個人都有自己的立場，但善良沒有。無論立場，只為拯救每個為善良奮鬥的人。<br><br>這裡還是我熟悉的家嗎?",
    "portfolio.Kindness.intro": "學習過程中的專題，<span class=\"Text-point\">使用Unity製作</span>，當時正值反送中話題討論度最高的時候，便以此做主題，練習製作卡牌遊戲。單回合有30秒，示威者會不斷地遭受攻擊。玩家扮演救護員，沒有所謂的立場，只是盡力拯救每個生命。<br><br><strong>學習為目標製作的遊戲，無上架計畫。</strong>",
    "other.title": "其他",
    "other.maruko.title": "櫻桃小丸子-元氣版",
    "other.AnimalStrikers.title": "漿果戰祭",
    "common.go": "前往 !"
  }
}